Ran Plan for dir: `live/dev/webserver-cluster` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
- destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.asg.aws_autoscaling_group.this will be updated in-place
~ resource "aws_autoscaling_group" "this" {
        arn                       = "arn:aws:autoscaling:eu-west-2:565938106136:autoScalingGroup:e87cf7aa-ca19-4075-95ba-ab68f954b28a:autoScalingGroupName/tf-asg-20200518201555326300000002"
        availability_zones        = [
            "eu-west-2a",
            "eu-west-2b",
            "eu-west-2c",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "ELB"
        id                        = "tf-asg-20200518201555326300000002"
      ~ launch_configuration      = "terraform-20200518201554542700000001" -> (known after apply)
        load_balancers            = []
        max_instance_lifetime     = 0
        max_size                  = 4
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "tf-asg-20200518201555326300000002"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::565938106136:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = [
            "arn:aws:elasticloadbalancing:eu-west-2:565938106136:targetgroup/tf-atlantis-atlantis/52150a978e2c39d9",
        ]
        termination_policies      = []
        vpc_zone_identifier       = [
            "subnet-273ae16b",
            "subnet-7fc85c05",
            "subnet-d5367ebc",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
            value               = "tf-atlantis"
        }
    }

  # module.asg.aws_launch_configuration.this must be replaced
+/- resource "aws_launch_configuration" "this" {
      ~ arn                              = "arn:aws:autoscaling:eu-west-2:565938106136:launchConfiguration:74ce674d-c829-4a45-9eeb-c8da06a0a482:launchConfigurationName/terraform-20200518201554542700000001" -> (known after apply)
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
        iam_instance_profile             = "ora2postgres_atlantis"
      ~ id                               = "terraform-20200518201554542700000001" -> (known after apply)
        image_id                         = "ami-01a6e31ac994bbc09"
        instance_type                    = "t2.micro"
        key_name                         = "atlantis"
      ~ name                             = "terraform-20200518201554542700000001" -> (known after apply)
      ~ security_groups                  = [ # forces replacement
            "sg-0d190f457cbf526ed",
          - "sg-0da3bbf97fcc6c17f",
            "sg-0f1133cc18e4468cf",
            "sg-0f5fd4bfcf8ec5e5e",
        ]
        user_data                        = "3ed8dac207bd268bbecc409fc56cc3b241292228"
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.asg.aws_security_group.web will be destroyed
- resource "aws_security_group" "web" {
      - arn                    = "arn:aws:ec2:eu-west-2:565938106136:security-group/sg-0da3bbf97fcc6c17f" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-0da3bbf97fcc6c17f" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "tf-atlantis-web" -> null
      - owner_id               = "565938106136" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - vpc_id                 = "vpc-371c5a5f" -> null
    }

  # module.asg.aws_security_group_rule.allow_web will be destroyed
- resource "aws_security_group_rule" "allow_web" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - from_port         = 80 -> null
      - id                = "sgrule-3879118822" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "tcp" -> null
      - security_group_id = "sg-0da3bbf97fcc6c17f" -> null
      - self              = false -> null
      - to_port           = 80 -> null
      - type              = "ingress" -> null
    }

Plan: 1 to add, 1 to change, 3 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d live/dev/webserver-cluster`
* :put_litter_in_its_place: To **delete** this plan click [here](http://tf-atlantis-alb-1828370094.eu-west-2.elb.amazonaws.com/events/lock?id=baranovRP%252Ftf-aws-rnbv-complex%252Flive%252Fdev%252Fwebserver-cluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d live/dev/webserver-cluster`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
